package com.mmednet.robotGuide.bean;

import com.j256.ormlite.field.DatabaseField;
import com.j256.ormlite.table.DatabaseTable;

import java.io.Serializable;
import java.math.BigDecimal;

/**
 * 智能导诊 症状和科室对应表
 *
 * @author zdb
 *         created by 2016/9/2 15:09
 */
@DatabaseTable(tableName = "sys_intelligent_guide_symptom_department")
public class IntelligentGuideSymptomDepartment implements Serializable,Comparable<IntelligentGuideSymptomDepartment> {

    public IntelligentGuideSymptomDepartment(){}

    public IntelligentGuideSymptomDepartment(String departmentName,String weight){
        this.departmentName = departmentName;
        this.weight = weight;
    }

    @DatabaseField(columnName = "id", generatedId = true, canBeNull = false)
    public int id;

    /**
     * 科室名称
     */
    @DatabaseField(columnName = "department_name")
    public String departmentName;

    /**
     * 对应数值
     */
    @DatabaseField(columnName = "weight")
    public String weight;

    /**
     * 症状id
     */
    @DatabaseField(columnName = "symptom_id")
    public int symptomId;

    @Override
    public int compareTo(IntelligentGuideSymptomDepartment o) {
        BigDecimal data1 = new BigDecimal(this.weight);
        BigDecimal data2 = new BigDecimal(o.weight);
        return data2.compareTo(data1);
    }

    public static String getCreateSql() {
        return "CREATE TABLE sys_intelligent_guide_symptom_department ( \n" +
                "    id              INTEGER PRIMARY KEY AUTOINCREMENT,\n" +
                "    department_name VARCHAR,\n" +
                "    symptom_id      INTEGER,\n" +
                "    weight          VARCHAR \n" +
                ");";
    }

    public static String getInsertSql() {
        return "INSERT INTO `sys_intelligent_guide_symptom_department` VALUES (1, '呼吸内科', '1', '1.85'),\n" +
                " (2, '神经内科', '2', '1.8'),\n" +
                " (3, '心血管内科', '3', '1.5'),\n" +
                " (4, '神经内科', '4', '1.7'),\n" +
                " (5, '消化内科', '5', '1.85'),\n" +
                " (6, '消化内科', '6', '1.85'),\n" +
                " (7, '肾内科', '7', '1.8'),\n" +
                " (8, '呼吸内科', '8', '1.7'),\n" +
                " (9, '呼吸内科', '9', '1.7'),\n" +
                " (10, '呼吸内科', '10', '1.7'),\n" +
                " (11, '神经内科', '11', '1.7'),\n" +
                " (12, '神经内科', '12', '1.7'),\n" +
                " (13, '心血管内科', '13', '1.55'),\n" +
                " (14, '心血管内科', '14', '1.8'),\n" +
                " (15, '呼吸内科', '15', '1.75'),\n" +
                " (16, '心血管内科', '16', '1.85'),\n" +
                " (17, '消化内科', '17', '1.85'),\n" +
                " (18, '血液内科', '18', '1.65'),\n" +
                " (19, '消化内科', '19', '1.8'),\n" +
                " (20, '呼吸内科', '20', '1.55'),\n" +
                " (21, '骨外科', '21', '1.65'),\n" +
                " (22, '消化内科', '22', '1.7'),\n" +
                " (23, '消化内科', '23', '1.7'),\n" +
                " (24, '消化内科', '24', '1.7'),\n" +
                " (25, '消化内科', '25', '1.7'),\n" +
                " (26, '消化内科', '26', '1.75'),\n" +
                " (27, '骨外科', '27', '1.8'),\n" +
                " (28, '血液内科', '28', '1.8'),\n" +
                " (29, '肾内科', '29', '1.75'),\n" +
                " (30, '骨外科', '30', '1.7'),\n" +
                " (31, '骨外科', '31', '1.7'),\n" +
                " (32, '神经内科', '32', '1.65'),\n" +
                " (33, '肾内科', '33', '1.75'),\n" +
                " (34, '肾内科', '34', '1.75'),\n" +
                " (35, '肾内科', '35', '1.75'),\n" +
                " (36, '肾内科', '36', '1.65'),\n" +
                " (37, '传染科', '1', '1.65'),\n" +
                " (38, '消化内科', '2', '1.2'),\n" +
                " (39, '血液内科', '3', '1.4'),\n" +
                " (40, '心血管内科', '4', '1.55'),\n" +
                " (41, '内分泌科', '5', '1.5'),\n" +
                " (42, '血液内科', '6', '1.4'),\n" +
                " (43, '变态反应科', '7', '1.2'),\n" +
                " (44, '心血管内科', '8', '1.55'),\n" +
                " (45, '心血管内科', '9', '1.55'),\n" +
                " (46, '心血管内科', '10', '1.55'),\n" +
                " (47, '心血管内科', '11', '1.6'),\n" +
                " (48, '呼吸内科', '12', '1.55'),\n" +
                " (49, '内分泌科', '13', '1.4'),\n" +
                " (50, '呼吸内科', '14', '1.35'),\n" +
                " (51, '心血管内科', '15', '1.5'),\n" +
                " (52, '内分泌科', '16', '1.6'),\n" +
                " (53, '神经内科', '17', '1.65'),\n" +
                " (54, '肾内科', '18', '1.3'),\n" +
                " (55, '血液内科', '19', '1.55'),\n" +
                " (56, '心血管内科', '20', '1.5'),\n" +
                " (57, '呼吸内科', '21', '1.45'),\n" +
                " (58, '血液内科', '22', '1.5'),\n" +
                " (59, '心血管内科', '23', '1.35'),\n" +
                " (60, '传染科', '24', '1.5'),\n" +
                " (61, '肾内科', '25', '1.35'),\n" +
                " (62, '血液内科', '26', '1.55'),\n" +
                " (63, '结缔组织病', '27', '1.65'),\n" +
                " (64, '骨外科', '28', '1.5'),\n" +
                " (65, '心血管内科', '29', '1.25'),\n" +
                " (66, '结缔组织病', '30', '1.55'),\n" +
                " (67, '结缔组织病', '31', '1.5'),\n" +
                " (68, '骨外科', '32', '1.45'),\n" +
                " (69, '血液内科', '33', '1.55'),\n" +
                " (70, '内分泌科', '34', '1.45'),\n" +
                " (71, '内分泌科', '35', '1.45'),\n" +
                " (72, '内分泌科', '36', '1.6'),\n" +
                " (73, '变态反应科', '1', '1.45'),\n" +
                " (74, '心血管内科', '2', '1.1'),\n" +
                " (75, '内分泌科', '3', '1.35'),\n" +
                " (76, '呼吸内科', '4', '1.3'),\n" +
                " (77, '肾内科', '5', '1.4'),\n" +
                " (78, '传染科', '6', '1.2'),\n" +
                " (79, '内分泌科', '7', '1.05'),\n" +
                " (81, '血液内科', '9', '1.15'),\n" +
                " (82, '血液内科', '10', '1.15'),\n" +
                " (83, '呼吸内科', '11', '1.45'),\n" +
                " (84, '心血管内科', '12', '1.55'),\n" +
                " (85, '神经内科', '13', '1.4'),\n" +
                " (86, '消化内科', '14', '1.2'),\n" +
                " (87, '神经内科', '15', '1.35'),\n" +
                " (88, '神经内科', '16', '1.2'),\n" +
                " (89, '内分泌科', '17', '1.35'),\n" +
                " (90, '消化内科', '18', '1.15'),\n" +
                " (91, '结缔组织病', '19', '1.25'),\n" +
                " (92, '消化内科', '20', '1.4'),\n" +
                " (93, '消化内科', '21', '1.35'),\n" +
                " (94, '肾内科', '22', '1.2'),\n" +
                " (95, '肾内科', '23', '1.25'),\n" +
                " (96, '血液内科', '24', '1.3'),\n" +
                " (97, '内分泌科', '25', '1.35'),\n" +
                " (98, '骨外科', '26', '1.25'),\n" +
                " (99, '变态反应科', '27', '1.5'),\n" +
                " (100, '心血管内科', '28', '1.25'),\n" +
                " (102, '血液内科', '30', '1.1'),\n" +
                " (103, '肾内科', '31', '1.3'),\n" +
                " (104, '血液内科', '32', '1.1'),\n" +
                " (105, '心血管内科', '33', '1.35'),\n" +
                " (106, '消化内科', '34', '1.15'),\n" +
                " (109, '消化内科', '1', '1.25'),\n" +
                " (110, '结缔组织病', '2', '1'),\n" +
                " (111, '呼吸内科', '3', '1.25'),\n" +
                " (112, '消化内科', '4', '1.2'),\n" +
                " (113, '血液内科', '5', '1.1'),\n" +
                " (114, '呼吸内科', '6', '1.1'),\n" +
                " (117, '传染科', '9', '1.05'),\n" +
                " (119, '骨外科', '11', '1.35'),\n" +
                " (120, '骨外科', '12', '1.45'),\n" +
                " (121, '呼吸内科', '13', '1.2'),\n" +
                " (122, '骨外科', '14', '1.1'),\n" +
                " (123, '消化内科', '15', '1.1'),\n" +
                " (125, '骨外科', '17', '1.3'),\n" +
                " (127, '肾内科', '19', '1.25'),\n" +
                " (128, '骨外科', '20', '1.1'),\n" +
                " (129, '肾内科', '21', '1.35'),\n" +
                " (130, '传染科', '22', '1.1'),\n" +
                " (131, '血液内科', '23', '1.2'),\n" +
                " (132, '变态反应科', '24', '1.2'),\n" +
                " (133, '血液内科', '25', '1.1'),\n" +
                " (135, '血液内科', '27', '1.45'),\n" +
                " (138, '肾内科', '30', '1.1'),\n" +
                " (141, '骨外科', '33', '1.15'),\n" +
                " (145, '血液内科', '1', '1.25'),\n" +
                " (147, '肾内科', '3', '1.1'),\n" +
                " (148, '内分泌科', '4', '1.1'),\n" +
                " (155, '血液内科', '11', '1.15'),\n" +
                " (156, '内分泌科', '12', '1.2'),\n" +
                " (157, '血液内科', '13', '1.05'),\n" +
                " (159, '内分泌科', '15', '1.05'),\n" +
                " (163, '心血管内科', '19', '1.15'),\n" +
                " (165, '神经内科', '21', '1.2'),\n" +
                " (167, '内分泌科', '23', '1.1'),\n" +
                " (171, '传染科', '27', '1.3'),\n" +
                " (181, '心血管内科', '1', '1.2'),\n" +
                " (183, '神经内科', '3', '1'),\n" +
                " (191, '内分泌科', '11', '1.15'),\n" +
                " (192, '血液内科', '12', '1.1'),\n" +
                " (195, '肾内科', '15', '1.05'),\n" +
                " (199, '呼吸内科', '19', '1.1'),\n" +
                " (201, '结缔组织病', '21', '1.05'),\n" +
                " (203, '变态反应科', '23', '1.1'),\n" +
                " (207, '内分泌科', '27', '1.15'),\n" +
                " (217, '内分泌科', '1', '1.15'),\n" +
                " (227, '结缔组织病', '11', '1.05'),\n" +
                " (231, '血液内科', '15', '1'),\n" +
                " (235, '骨外科', '19', '1'),\n" +
                " (253, '肾内科', '1', '1.05');";
    }


}
