package com.mmednet.robotGuide.bean;

import com.j256.ormlite.field.DatabaseField;
import com.j256.ormlite.table.DatabaseTable;

import java.io.Serializable;
import java.util.HashMap;
import java.util.Map;

import com.mmednet.robotGuide.R;

/**
 * 智能导诊科室描述
 *
 * @author zdb
 *         created by 2016/9/2 15:04
 */
@DatabaseTable(tableName = "sys_intelligent_guide_department")
public class IntelligentGuideDepartment implements Serializable {

    private static final long serialVersionUID = -3004286406715704401L;


    @DatabaseField(columnName = "id", generatedId = true, canBeNull = false)
    public int id;

    /**
     * 科室名称
     */
    @DatabaseField(columnName = "name")
    public String name;

    /**
     * 科室描述
     */
    @DatabaseField(columnName = "describe")
    public String describe;

    /**
     * 图片路径
     */
    @DatabaseField(columnName = "photoPath")
    public String photoPath;

    /**
     * 相关疾病
     */
    @DatabaseField(columnName = "relatedDiseases")
    public String relatedDiseases;

    /**
     * 科室类型：1非手术科室；2手术科室；3诊断相关科室
     */
    @DatabaseField(columnName = "departmentType")
    public int departmentType;


    private String url;

    /**
     * 推荐医院1
     **/
    @DatabaseField(columnName = "suggest_hospital1")
    public String suggestHospital1;

    /**
     * 推荐医院1
     **/
    @DatabaseField(columnName = "suggest_hospital2")
    public String suggestHospital2;

    /**
     * 推荐医院1
     **/
    @DatabaseField(columnName = "suggest_hospital3")
    public String suggestHospital3;

    @Override
    public String toString() {
        return "\nIntelligentGuideDepartment{" +
                "id=" + id +
                ", name='" + name + '\'' +
                ", describe='" + describe + '\'' +
                ", photoPath='" + photoPath + '\'' +
                ", relatedDiseases='" + relatedDiseases + '\'' +
                ", departmentType=" + departmentType +
                ", url='" + url + '\'' +
                ", suggestHospital1='" + suggestHospital1 + '\'' +
                ", suggestHospital2='" + suggestHospital2 + '\'' +
                ", suggestHospital3='" + suggestHospital3 + '\'' +
                "}\n";
    }

    public static String getCreateSql() {
        return "CREATE TABLE sys_intelligent_guide_department ( \n" +
                "    id                INTEGER PRIMARY KEY AUTOINCREMENT,\n" +
                "    name              VARCHAR,\n" +
                "    describe          VARCHAR,\n" +
                "    photoPath         VARCHAR,\n" +
                "    relatedDiseases   VARCHAR,\n" +
                "    departmentType    INTEGER,\n" +
                "    suggest_hospital1 VARCHAR,\n" +
                "    suggest_hospital2 VARCHAR,\n" +
                "    suggest_hospital3 VARCHAR \n" +
                ")";
    }

    public static String getInsertSql() {
        return "INSERT INTO `sys_intelligent_guide_department` VALUES (973, '骨外科', '骨外科是医疗机构的一个诊疗科目，是创伤、脊柱外科的总称，是以诊疗各种类型断指、断掌、多指离断的再植、各种类型皮瓣移植、神经修复术、四肢先天性畸形、臂丛神经损伤及神经卡压的诊治的专业科室。', 'http://218.241.151.250/static/appimg/973.png', '急慢性软组织损伤、急慢性颈腰肌损伤、关节软组织损伤、颈椎病、腰椎病、肩周炎、网球肘、骨折、脱位等。', '2', '北京积水潭（67.3%）', '北京301医院 （17.50%）', '北京大学第一医院（15.20%)'),\n" +
                "(974, '神经内科', '神经内科是独立的二级学科；神经系统由脑、脊髓及周围神经组成。', 'http://218.241.151.250/static/appimg/974.png', '脑血管疾病（脑梗塞、脑出血）、偏头痛、脑部炎症性疾病（脑炎、脑膜炎）、脊髓炎、癫痫、痴呆、神经系统变性病、代谢病和遗传病、三叉神经痛、坐骨神经病、周围神经病（四肢麻木、无力）及重症肌无力等。', '1', '首都医科大学宣武医院 (63.7%)', '北京天坛医院 (22.3%)', '北京301医院 (14.0%)'),\n" +
                "(975, '呼吸内科', '肺结核,感冒,肺炎等呼吸内科疾病,同时为您推荐最权威的呼吸内科治疗医院,以及提供免费的呼吸内科医生在线专家在线咨询服务', 'http://218.241.151.250/static/appimg/975.png', '减压病 气胸 卡氏肺囊虫肺炎 小儿结核病 妊娠合并肺结核 肺放线菌病 休克型肺炎 淹溺', '1', '北京协和医院 (60.0%)', '中日友好医院 (25.0%)', '复旦大学附属中山医院 (15.0%)'),\n" +
                "(976, '心血管内科', '心内科，即心血管内科，是各级医院大内科为了诊疗心血管血管疾病而设置的一个临床科室', 'http://218.241.151.250/static/appimg/976.png', '冠心病、高血压、心律失常、房颤、阵发性室上性心动过速、心衰、心肌炎、先天性心脏病、心肌病、房间隔缺损、风湿性心脏病、心肌梗死、心绞痛、急性感染性心内膜炎、心肌缺血。', '1', '北京阜外医院 (55.0%)', '北京安贞医院 (35%)', ' 复旦大学附属中山医院 (10.0%)'),\n" +
                "(977, '泌尿外科', '泌尿外科是个比较古老的专科，有较久的历史；但同时却又是个比较新的专科。', 'http://218.241.151.250/static/appimg/977.png', '尿结石和复杂性肾结石、肾脏和膀胱肿瘤、前列腺增生和前列腺炎、睾丸附睾的炎症和肿瘤、睾丸精索鞘膜积液、各种泌尿系损伤、泌尿系先天性畸形如尿道下裂、隐睾、肾盂输尿管连接部狭窄所导致的肾积水等。', '2', '北京大学第一医院 (43.2%)', '上海仁济医院(34.7％)', '上海市第一人民医院 (22.1%)'),\n" +
                "(978, '消化内科', '消化内科是研究食管、胃、小肠、大肠、肝、胆及胰腺等疾病为主要内容的临床三级学科。消化病分为胃肠病、肝病、胰胆疾病、内镜和其它疾病5个部分。', 'http://218.241.151.250/static/appimg/978.png', '急性腹痛、腹水、消化道出血、功能性便秘、食管炎、食管癌、急性胃炎、慢性胃炎、胃粘膜巨肥症、急性胃扩张、胃扭转、胃内异物、消化性溃疡等。', '1', '北京协和医院(43.0%) ', '西京医院 (28.7%)', '南京鼓楼医院 (28.3%)'),\n" +
                "(979, '耳鼻喉科', '耳鼻喉科是诊断治疗耳、鼻、咽喉、及其相关头颈区域的外科学科。', 'http://218.241.151.250/static/appimg/979.png', '耳部疾病：中耳炎、耳鸣、外耳炎、耳聋、鼓膜穿孔、鼓膜修补、听力障碍；鼻部疾病：急性鼻炎、慢性鼻炎、鼻窦炎、鼻息肉、过敏鼻炎、鼻部整形；咽喉疾病：喉炎、慢性咽炎、扁桃体炎、鼾症、声带息肉、急性咽炎等。', '2', '北京同仁医院 (57.0%)', '复旦大学附属眼耳鼻喉科医院 (32.0%）', '北京301医院 (11.0%)'),\n" +
                "(980, '肾内科', '肾脏病是常见病和多发病，如果恶化可以发展为尿毒症，严重危害人们健康。', 'http://218.241.151.250/static/appimg/980.png', '急性肾小球肾炎、急进性肾小球肾炎、慢性肾小球肾炎、肾病综合征、IgA肾病、间质性肾炎、肾小管酸中毒、急性肾衰竭、慢性肾衰竭、膜性肾病、系统性红斑狼疮肾炎、高血压肾损害、糖尿病肾病等', '1', '南京军区总医院 (57.3%)', '北京大学第一医院 (32.5%)', '西京医院 (10.2%）'),\n" +
                "(981, '血液内科', '针对血液内科疾病的特点，就相关疾病从概述、流行病学、病因、生理病理、分型、检查、临床表现、诊断与鉴别诊断等方面做了整体的阐述，重点汇总介绍国内外最新公布的诊断标准。', 'http://218.241.151.250/static/appimg/981.png', '巨幼细胞贫血、再生障碍性贫血、再生障碍性贫血、慢性淋巴细胞白血病、恶性淋巴瘤', '1', '北京大学人民医院 （43.0%）', '北京协和医院 （29.7%）', '中国医学科学院血液学研究所血液病医院 （23.3%）'),\n" +
                "(982, '变态反应科', '变态反应学是一门年轻的临床科学。随着近代科学，特别是免疫学的飞速发展，变态反应才得到应有的重视，成为近代临床医学中不可或缺的组成部分。', 'http://218.241.151.250/static/appimg/982.png', '免疫和变态反应、细胞免疫、食物变态反应、变应性血管炎、肾上腺皮质激素、过敏反应、变应性鼻窦炎和鼻息肉病、支气管哮喘、 阿司匹林耐受不良和运动性哮喘等。', '1', '北京协和医院 （51.2%）', '武汉同济医院 （25.8%）', '山东省立医院 （23.0%）'),\n" +
                "(983, '急诊', '紧急救治和抢救，指在紧急情况下的治疗。它的存在保证了我们在突发疾病、意外伤害时，能在最快时间内得到专业、科学的救治。（指医院的急诊科）', 'http://218.241.151.250/static/appimg/983.png', '气管插管病人、无呼吸或无脉搏病人、急性意识障碍病人、需要采取挽救生命干预措施病人、急性意识模糊或定向力障碍、复合伤、心绞痛的病人等。这类病人应立即送入急诊抢救室。', '1', '北京安贞医院 （40.0%）', '广东省中医院 (31.7%)', '郑州大学一附院 (28.3%)'),\n" +
                "(984, '内分泌科', '内分泌科是医院中一个专门治疗内分泌科疾病的地方。', 'http://218.241.151.250/static/appimg/984.png', '糖尿病、肥胖症、骨质疏松、痛风、脂质代谢紊乱以及甲状腺、垂体、肾上腺、性腺、甲状旁腺等疾病的临床诊治。', '1', '北京协和医院 (34.6％)', '上海瑞金医院 (35.0%)', '中国医科大学附属第一医院 (30.4%)'),\n" +
                "(985, '普通外科', '普外科是以手术为主要方法治疗肝脏、胆道、胰腺、胃肠、肛肠、血管疾病、甲状腺和乳房的肿瘤及外伤等其它疾病的临床学科，是外科系统最大的专科。', 'http://218.241.151.250/static/appimg/985.png', '颈部疾病、乳腺疾病、腹部急症、胃肠疾病、肛管直肠疾病、肝胆胰脾疾病等。', null, '南京军区总医院 (47.0%）', '复旦大学附属中山医院 (35.0%)', '医科院肿瘤医院 (18.0%)'),\n" +
                "(986, '传染科', '如有不明原因发热细菌感染性疾病病毒性肝炎肝硬化和新发再发传染病的，请立即就医。', 'http://218.241.151.250/static/appimg/986.png', '猪流感,禽流感,乙肝,性病,艾滋病,感冒,水痘,手足口病,梅毒等常见传染科疾病。', '1', '复旦大学附属华山医院 (45.0%)', '中山大学附属第三医院 (28.3%)', ' 浙江大学附属第一医院 (26.7%)'),\n" +
                "(987, '神经外科', '神经外科是外科学中的一个分支，是在外科学以手术为主要治疗手段的基础上，应用独特的神经外科学研究方法，研究人体神经系统。', 'http://218.241.151.250/static/appimg/987.png', '外伤导致的脑部、脊髓等神经系统的疾病，例如脑出血出血量危及生命,车祸致脑部外伤，或脑部有肿瘤压迫需手术治疗等。', '2', '北京天坛医院(46.9%)', '复旦大学附属华山医院 (27.0%)', '首都医科大学宣武医院 (26.1%)'),\n" +
                "(988, '妇产科', '妇产科是临床医学四大主要学科之一，主要研究女性生殖器官疾病的病因、病理、诊断及防治，妊娠、分娩的生理和病理变化，高危妊娠及难产的预防和诊治，女性生殖内分分泌，计划生育及妇女保健等。', 'http://218.241.151.250/static/appimg/988.png', '女性生殖器官感染、创伤、脱垂、发育畸形和子宫内膜异位症等。', '2', '复旦大学附属妇产科医院 (38.0%)', '首都医科大学附属复兴医院 (32.0%)', '北京朝阳医院(30.0%)'),\n" +
                "(989, '结缔组织病', '以疏松结缔组织粘液样水肿及纤维蛋白样变性为病理基础的一组疾病。', 'http://218.241.151.250/static/appimg/989.png', '红斑狼疮、硬皮病、皮肌炎、类风湿性关节炎、结节性多动脉炎、韦格纳氏肉芽肿、巨细胞动脉炎及干燥综合征等。', '1', ' 北京协和医院 (43.0%) ', '北京301医院 （25.8%）', '北京大学第三医院 (31.2%)'),\n" +
                "(990, '胸外科', '胸外科学是一门医学专科，专门研究胸腔内器官，主要指食道、肺部、纵隔病变的诊断及治疗，乳腺外科领域也被归入这个专科，其中又以肺外科和食道外科为主。', 'http://218.241.151.250/static/appimg/990.png', '发生在与生命相关的脏器，如心脏、肺脏，其治疗过程亦常影响到这些脏器功能的稳定，从而对生命造成威胁。', '2', '上海市肺科医院 （43.0%)', '医科院肿瘤医院 (30.9%)', '上海市胸科医院 (26.1%)'),\n" +
                "(991, '精神科', '精神科涉及到的疾病是一组以表现在行为、心理活动上的紊乱为主的神经系统疾病。', 'http://218.241.151.250/static/appimg/991.png', '精神科疾病有脑器质性精神障碍、躯体疾病所致精神障碍、精神活性物质所致精神障碍、精神分裂症、偏执性及其他精神病性障碍等。', '1', '北京安定医院 (63.0%)', '上海市精神卫生中心( 21.0%)', '北京大学第六医院(16.0%）'),\n" +
                "(992, '普外科', '普外科是以手术为主要方法治疗肝脏、胆道、胰腺、胃肠、肛肠、血管疾病、甲状腺和乳房的肿瘤及外伤等其它疾病的临床学科，是外科系统最大的专科。', 'http://218.241.151.250/static/appimg/992.png', '颈部疾病、乳腺疾病、腹部急症、胃肠疾病、肛管直肠疾病、肝胆胰脾疾病等。', '2', '南京军区总医院 (47.0%）', '复旦大学附属中山医院 (35.0%)', '医科院肿瘤医院 (18.0%)'),\n" +
                "(993, '眼科', '眼科的全称是“眼病专科”。眼科是研究发生在视觉系统，包括眼球及与其相关联的组织有关疾病的学科。', 'http://218.241.151.250/static/appimg/993.png', '中心浆液性视网膜病变、干眼症、交感性眼炎、夜盲症、失明、弱视、散光、沙眼、白内障、糖尿病视网膜病变、结膜炎、老花眼、色盲、虹膜异色症、视网膜色素变性、视网膜中央动脉阻塞、视网膜脱落、近视、远视、针眼、雪盲症、霰粒肿、青光眼、飞蚊症等。', null, '北京同仁医院 (57.0%)', '北京大学第三医院 （25.0%)', '上海交通大学医学院附属第九人民医院(18.0%) '),\n" +
                "(994, '妇科', '妇科是医疗机构的一个诊疗科目，是妇产科的一个分支专业，是以诊疗女性妇科病为诊疗的专业科室，分为西医妇科与中医妇科。', 'http://218.241.151.250/static/appimg/994.png', '女性生殖系统的疾病即为妇科疾病，包括外阴疾病、阴道疾病、子宫疾病、输卵管疾病、卵巢疾病等。', null, '北京协和医院 （40.0%）', '复旦大学附属妇产科医院 (35.0%)', '上海市第一妇婴保健院 （25.0%）'),\n" +
                "(996, '传染病', '传染病是由各种病原体引起的能在人与人、动物与动物或人与动物之间相互传播的一类疾病。', 'http://218.241.151.250/static/appimg/996.png', '中国目前的法定传染病有甲、乙、丙3类，共39种。', null, '复旦大学附属华山医院 (45.0%)', '中山大学附属第三医院 (28.3)', ' 浙江大学附属第一医院 (26.7%)'),\n" +
                "(997, '皮肤性病科', '皮肤性病科是治疗皮肤和性病疾病的医学分支。也指综合性医院当中诊疗皮肤疾病的科室。在广义上，皮肤科还包含对头发、指（趾）甲疾病的治疗。', 'http://218.241.151.250/static/appimg/997.png', '牛皮癣、 疱疹、酒渣鼻、脓疱疮、妇科疾病、男科炎症、前列腺炎、化脓菌感染、鱼鳞病、腋臭、青春痘 、毛囊炎、斑秃脱发、雀 、汗疱疹、螨虫性皮炎、白癜风、湿疹、灰指甲、硬皮病、皮肤瘙痒等。', '1', '北京地坛医院（41.5%）', '江西省皮肤病专科医院 （30.0%）', '广东省皮肤病医院（28.5%）'),\n" +
                "(998, '心内科', '心内科，即心血管内科，是各级医院大内科为了诊疗心血管血管疾病而设置的一个临床科室。', 'http://218.241.151.250/static/appimg/998.png', '冠心病、高血压、心律失常、房颤、阵发性室上性心动过速、心衰、心肌炎、先天性心脏病、心肌病、房间隔缺损、风湿性心脏病、心肌梗死、心绞痛、急性感染性心内膜炎、心肌缺血。', null, '北京阜外医院 (55.0%)', '北京安贞医院 (35%)', ' 复旦大学附属中山医院 (10.0%)'),\n" +
                "(999, '移植科', '移植科主要', 'http://218.241.151.250/static/appimg/999.png', '在肝脏肾脏心脏胰腺甲状旁腺小肠及腹部多器官移植等。', null, '武汉同济医院 (35.0%)', '天津市第一中心医院 (34.6％)', '武警总医院(30.4%)'),\n" +
                "(1001, '骨科', '骨外科是医疗机构的一个诊疗科目，是创伤、脊柱外科的总称，是以诊疗各种类型断指、断掌、多指离断的再植、各种类型皮瓣移植、神经修复术、四肢先天性畸形、臂丛神经损伤及神经卡压的诊治的专业科室。', 'http://218.241.151.250/static/appimg/1001.png', '', null, '北京积水潭（67.3%）', '北京301医院 （17.50%）', '北京大学第一医院（ 15.20%)'),\n" +
                "(1002, '脑外科', '神经外科以功能外科、血管内神经外科和脑肿瘤显微外科手术为专业的学科。', 'http://218.241.151.250/static/appimg/1002.png', '脑血栓、脑震荡、脑梗塞、脑出血、脑栓塞、丘脑下部损伤、迁延性昏迷、脑室内出血、脑脊液漏、上皮样囊肿、肌营养不良症、神经胶质瘤、脑挫裂伤、颅骨骨髓炎、颈椎椎弓裂、颈椎过伸性损伤、急性和亚急性硬脑膜下血肿、基底节血肿、颈椎后纵韧带骨化症。', null, '北京天坛医院(46.9%)', '复旦大学附属华山医院 (27.0%)', '首都医科大学宣武医院 (26.1%)'),\n" +
                "(1003, '肿瘤生物治疗科', '治疗手段在以突出生物治疗为特色的基础上将化疗、放疗有机地联合融入，在过继免疫细胞治疗、干细胞治疗(自体及异体)、肿瘤DC疫苗治疗、基因治疗等。', 'http://218.241.151.250/static/appimg/1003.png', '肺癌、肾癌、恶性黑色素瘤、卵巢癌等实体瘤的治疗。', null, '北京301医院  (40.0%)', '医科院肿瘤医院（35.0%）', '北京大学肿瘤医院(25.0%)'),\n" +
                "(1004, '耳鼻咽喉科', '耳鼻喉科是诊断治疗耳、鼻、咽喉、及其相关头颈区域的外科学科。', 'http://218.241.151.250/static/appimg/1004.png', '耳部疾病：中耳炎、耳鸣、外耳炎、耳聋、鼓膜穿孔、鼓膜修补、听力障碍；鼻部疾病：急性鼻炎、慢性鼻炎、鼻窦炎、鼻息肉、过敏鼻炎、鼻部整形；咽喉疾病：喉炎、慢性咽炎、扁桃体炎、鼾症、声带息肉、急性咽炎等。', null, '北京同仁医院 (57.0%)', '复旦大学附属眼耳鼻喉科医院 (32.0%）', '北京301医院 (11.0%)'),\n" +
                "(1005, '脊柱外科', '脊柱创伤、退变、肿瘤、畸形、感染等疾病的基础研究成果和临床诊治技术和疗法。', 'http://218.241.151.250/static/appimg/1005.png', '颈椎病、颈椎病、腰椎间盘出症、腰椎管狭窄症、骨质疏松症、颈椎损伤、脊柱肿瘤。', null, '北京大学第三医院 （37.0%）', '北京积水潭医院（35.0%）', '西京医院 （28.0%）'),\n" +
                "(1006, '神经肿瘤外科', '神经肿瘤外科是外科学中的一个分支，是在肿瘤外科学以手术为主要治疗手段的基础上，应用独特的神经外科学研究方法，研究人体神经肿瘤。', 'http://218.241.151.250/static/appimg/1006.png', '脑半球肿瘤、髓母细胞瘤、室管膜瘤、三脑室肿瘤、松果体肿瘤、颅咽管瘤、颅底肿瘤，以及髓内肿瘤、各种椎管内和脊柱肿瘤等。', null, '浙江大学附属第一医院 (41.3%)', '中国医科大学附属第一医院 (37.0%)', '北京天坛医院(21.7%)'),\n" +
                "(1007, '眼眶科', '眼眶内发生囊肿样占位病变，统称为眼眶囊肿，请及时就诊。', 'http://218.241.151.250/static/appimg/1007.png', '眼眶皮样囊肿、眼眶表皮样囊肿、眼眶黏液囊肿、眼眶寄生虫囊肿、眼眶植入性囊肿、眼眶血囊肿等', null, '', '', ''),\n" +
                "(1008, '肛肠科', '肛肠科是专业研究治疗便秘、肛裂、肛瘘、肛门脓肿、肛门狭窄、肛乳头肥大、肛周湿疹、混合痔、内痔、外痔得为主的科室。', 'http://218.241.151.250/static/appimg/1008.png', '如痔疮、肛裂、肛痿、肛周脓肿、肛乳头瘤、肛隐窝炎、肛门狭窄、肛门失禁、肛门湿疣、肛门湿疹、肛门瘙痒症、肛门周围神经性皮炎、肛门接触性皮炎、肛门癣、肛门闭锁、肛管炎、耻骨直肠肌综合症等。', null, '天津市人民医院 (40.2%）', '中国医科大学附属盛京医院 (30.8%）', '南京医科大学第一附属医院 (29.0)'),\n" +
                "(1009, '腹腔镜科', '腹腔镜科知识，腹腔镜与电子胃镜类似，是一种带有微型摄像头的器械，腹腔镜手术就是利用腹腔镜及其相关器械进行的手术', 'http://218.241.151.250/static/appimg/1009.png', '胆囊结石、急性腹痛、消化性溃疡、腹膜炎、肠阻塞、腹股沟疝气、胃肠道良性肿瘤、恶性肠胃道肿瘤、腹部外伤等。', null, '温州医科大学附属第一医院 (37.8%)', '医科院肿瘤医院(34.1%) ', '哈尔滨医科大学附属第二医院 (28.1%)'),\n" +
                "(1010, '肿瘤科', '肿瘤内科主要从事各种良、恶性肿瘤的内科治疗；肿瘤外科提供以手术为主的综合治疗。专门的肿瘤医院的相关科室会根据不同部位再行细分', 'http://218.241.151.250/static/appimg/1010.png', '乳腺癌、肺癌、肝癌、胃癌、结肠癌、直肠癌、食管癌、胰腺癌、鼻咽癌、膀胱癌、宫颈癌、前列腺癌、卵巢癌、肾癌、甲状腺癌、淋巴瘤、白血病、子宫内膜癌、黑色素瘤、骨肉瘤。', null, '医科院肿瘤医院(40.0%) ', '天津市肿瘤医院 (34.0%)', '哈尔滨医科大学附属肿瘤医院(26.0%) '),\n" +
                "(1011, '心血管外科', '我国心血管外科萌芽于本世纪四十年代后期，至今已有半个世纪的历史。直至七十年代中期以后才得到迅速发展，部分病种的外科治疗水平达到国际先进水平。', 'http://218.241.151.250/static/appimg/1011.png', '先天性心脏病、风湿性心脏瓣膜病、冠心病外科等。', null, '北京阜外医院 (55.0%)', '北京安贞医院 (35%)', '山东省立医院 （10.0%）'),\n" +
                "(1012, '腹腔科', '腹腔位于躯干腹部的腔,内衬腹膜，由体壁、横膈膜和盆底围成,其内容纳胃、肝、胆囊、脾脏、胰、肾脏、肠、阑尾、膀胱、泌尿系和妇科（子宫、附件）等其他内脏器官。', 'http://218.241.151.250/static/appimg/1012.png', '腹腔积水（心衰、缩窄性心包炎、肾衰、结核性腹膜炎，胰腺炎，肿瘤腹腔转移）、腹腔囊肿、腹腔科手术等。', null, '', '', ''),\n" +
                "(1013, '风湿免疫科', '风湿免疫科', null, '风湿免疫科', null, ' 北京协和医院 (43.0%) ', '北京301医院 (31.2%)', '北京大学第三医院 （25.8%）'),\n" +
                "(1014, '口腔科', null, null, null, null, '', '', '');";
    }

    static Map<Integer, Integer> iconMap = new HashMap<Integer, Integer>();

    static {
        iconMap.put(973, R.mipmap.k_973);
        iconMap.put(974, R.mipmap.k_974);
        iconMap.put(975, R.mipmap.k_975);
        iconMap.put(976, R.mipmap.k_976);
        iconMap.put(977, R.mipmap.k_977);
        iconMap.put(978, R.mipmap.k_978);
        iconMap.put(979, R.mipmap.k_979);
        iconMap.put(980, R.mipmap.k_980);
        iconMap.put(981, R.mipmap.k_981);
        iconMap.put(982, R.mipmap.k_982);
        iconMap.put(983, R.mipmap.k_983);
        iconMap.put(984, R.mipmap.k_984);
        iconMap.put(985, R.mipmap.k_985);
        iconMap.put(986, R.mipmap.k_986);
        iconMap.put(987, R.mipmap.k_987);
        iconMap.put(988, R.mipmap.k_988);
        iconMap.put(989, R.mipmap.k_989);
        iconMap.put(990, R.mipmap.k_990);
        iconMap.put(991, R.mipmap.k_991);
        iconMap.put(992, R.mipmap.k_992);
        iconMap.put(993, R.mipmap.k_993);
        iconMap.put(994, R.mipmap.k_994);
        iconMap.put(996, R.mipmap.k_996);
        iconMap.put(997, R.mipmap.k_997);
        iconMap.put(998, R.mipmap.k_998);
        iconMap.put(999, R.mipmap.k_999);
        iconMap.put(1001, R.mipmap.k_1001);
        iconMap.put(1002, R.mipmap.k_1002);
        iconMap.put(1003, R.mipmap.k_1003);
        iconMap.put(1004, R.mipmap.k_1004);
        iconMap.put(1005, R.mipmap.k_1005);
        iconMap.put(1006, R.mipmap.k_1006);
        iconMap.put(1007, R.mipmap.k_1007);
        iconMap.put(1008, R.mipmap.k_1008);
        iconMap.put(1009, R.mipmap.k_1009);
        iconMap.put(1010, R.mipmap.k_1010);
        iconMap.put(1011, R.mipmap.k_1011);
        iconMap.put(1012, R.mipmap.k_1012);

    }

    public static int getDrawable(int id) {
        return iconMap.get(id);
    }


}
